api-messages-rails/app/controllers/api/v1/messages_controller.rb

SELECT `messages`.* FROM `messages`
---
  def index
    @messages = Message.all

UPDATE `messages` SET `messages`.`counter` = COALESCE(`messages`.`counter`, 0) + 1 WHERE `messages`.`uuid` = x'b489b32a6a5011ebbca3c8e0eb167057'
---
  def show
    @message.increment!(:counter)

UPDATE `messages` SET `messages`.`content` = 'I love to code', `messages`.`updated_at` = '2021-02-08 21:35:35.858600' WHERE `messages`.`uuid` = x'c0912af46a5011ebbca3c8e0eb167057'
---
  def update
    if @message.update(message_params)

INSERT INTO `messages` (`uuid`, `content`, `created_at`, `updated_at`) VALUES (x'459EF7246A5811EBA57CC8E0EB167057', 'マグダは素晴らしいです', '2021-02-08 21:54:52.264269', '2021-02-08 21:54:52.264269')
---
  def create
    @message = Message.new(message_params)
    if @message.save!